# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [2]:
cars1 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv")
cars2 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv")

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [3]:
cars1.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN

In [4]:
cars2.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se

In [5]:
cars1.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model', 'origin', 'car', 'Unnamed: 9', 'Unnamed: 10',
       'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13'],
      dtype='object')

In [6]:
cars1 = cars1.drop(columns=['Unnamed: 9', 'Unnamed: 10',
       'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13'])
cars1.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320

### Step 5. What is the number of observations in each dataset?

In [8]:
print(cars1.shape[0])
print(cars2.shape[0])

198
200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [10]:
cars = pd.concat([cars1, cars2]).reset_index(drop=True)
print(cars.head(2))
print(cars.tail(2))

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70

   origin                        car
0       1  chevrolet chevelle malibu
1       1          buick skylark 320
      mpg  cylinders  displacement horsepower  weight  acceleration  model  \
396  28.0          4           120         79    2625          18.6     82
397  31.0          4           119         82    2720          19.4     82

     origin          car
396       1  ford ranger
397       1   chevy s-10

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [11]:
import random

In [12]:
owners = [ random.randint(15000, 73000) for x in range(len(cars)) ]
owners = pd.Series(owners)
owners

0      56679
1      37838
2      45467
3      16421
4      59446
       ...
393    51152
394    40474
395    28454
396    48852
397    26888
Length: 398, dtype: int64

In [16]:
import numpy as np
nr_owners = np.random.randint(15000, high=73001, size=398, dtype='l')
nr_owners

array([30511, 70526, 50568, 49325, 46980, 22075, 45844, 54589, 70870,
       39005, 62322, 56634, 32220, 51226, 67428, 44110, 53768, 64295,
       61210, 45439, 50726, 72365, 49901, 41956, 66626, 52392, 55550,
       22244, 31009, 58780, 22438, 69520, 37330, 71039, 54954, 24244,
       69203, 49660, 29164, 69325, 63126, 28055, 38054, 56279, 55196,
       48032, 58190, 21274, 17578, 63893, 17085, 43536, 39014, 55770,
       34358, 39687, 27933, 44930, 58825, 15283, 30740, 47105, 46053,
       54763, 26476, 32001, 53329, 48029, 35932, 33678, 64499, 39581,
       20852, 18277, 65206, 46887, 22945, 59742, 68746, 30176, 58912,
       24170, 47621, 31295, 64722, 42293, 15707, 69429, 57383, 26125,
       28797, 18207, 27422, 49063, 70030, 31904, 44809, 49058, 60322,
       47512, 34442, 20493, 54760, 39511, 53075, 26508, 21902, 57396,
       23952, 39106, 44346, 43074, 43622, 30743, 27245, 27891, 28823,
       62317, 46756, 39398, 48354, 63749, 23657, 35834, 23753, 58543,
       47907, 56509, 31960, 63619, 54233, 57593, 18979, 15707, 63725,
       31278, 56607, 22618, 54348, 41914, 61193, 43371, 48320, 37528,
       41788, 27770, 38801, 71248, 17788, 39501, 26379, 64376, 16653,
       43451, 32106, 42174, 56447, 51878, 43745, 69021, 61718, 46509,
       44997, 34663, 55852, 58530, 40436, 16249, 54445, 68855, 29183,
       67456, 56904, 62922, 51507, 21394, 70610, 29425, 49085, 47968,
       43414, 21151, 72162, 51047, 57406, 65235, 65617, 39128, 43529,
       57384, 15762, 60273, 47962, 44162, 46338, 54124, 69037, 49461,
       49022, 31617, 34318, 32139, 66810, 37262, 29528, 57728, 41163,
       68639, 67354, 62419, 48945, 24383, 35659, 45755, 26034, 42554,
       27391, 38502, 26549, 44553, 25795, 69199, 44390, 60744, 61521,
       34165, 50746, 48048, 46950, 71686, 32972, 30947, 41990, 56139,
       64583, 23220, 16014, 65437, 20909, 36270, 25691, 67525, 43669,
       70568, 21014, 59217, 51898, 45392, 50079, 40577, 46133, 60182,
       56014, 46229, 43017, 29630, 24703, 32166, 62810, 61756, 72598,
       33801, 44109, 60133, 31899, 45875, 40249, 41718, 26403, 49125,
       16927, 23918, 36382, 49580, 54287, 27557, 19599, 66856, 63949,
       39995, 45853, 15601, 68057, 35908, 72197, 62623, 66417, 52019,
       54166, 37082, 55288, 33560, 15740, 36969, 19797, 59878, 34936,
       25252, 42729, 63185, 62937, 69566, 21067, 72394, 61471, 29854,
       30996, 45539, 47275, 48113, 22926, 40447, 48660, 50229, 29666,
       34191, 64738, 63191, 39385, 57807, 71227, 15097, 33090, 15052,
       51684, 33505, 29519, 41788, 44000, 36117, 49840, 27970, 59480,
       60238, 25743, 20056, 28714, 57644, 52402, 54196, 39666, 41904,
       56444, 61932, 45049, 51743, 31019, 66441, 32590, 47935, 49266,
       37575, 21897, 69049, 71026, 46860, 68783, 28733, 72332, 60909,
       60279, 51520, 51844, 45637, 23650, 51400, 72535, 32134, 25232,
       34518, 37753, 71433, 24756, 41247, 51041, 59063, 45368, 48643,
       46423, 58399, 62360, 22417, 61388, 29773, 49655, 44777, 55374,
       21706, 68420, 40692, 28543, 25355, 25038, 54355, 17884, 35162,
       33432, 52663])

### Step 8. Add the column owners to cars

In [13]:
cars['owners'] = owners

In [14]:
cars.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,56679
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,37838